tests/cases/parallelTrappedAir/constant/moldingDict
FoamFile
{
    format      ascii;
    class       dictionary;
    object      moldingDict;
}
injection
{
    meltTemperature  480;
}
packing
{
    switchFraction   1;
    switchPressure   1e9;
    pressure
    {
        type            constant;
        value           1e5;
    }
}
cooling
{
    ejectionTemperature  50;
    releasePressure      1e5;
}
viscousDissipation  false;

// Weld-line prediction: record the fill time of every cell and the
// trapped-air field
writeFillTime     true;
trapAirInterval   100;
